<?php

//класс меню
class Menu
{
    protected $template;//файл html-шаблона статьи

    function __construct($template)
    {
        $this->template = file_get_contents($template);//прочитать файл в переменную
    }

    //читает и возвращает преобразованный файл шаблона меню
    //функции передается предварительно полученный программой  результирующий набор mysqli_result,
    // полученный из запроса в базу данных
    public function readTemplate($mysqli_object)
    {
        //переменная, которая будет возвращена методом
        $menu = "";
        //массив меток-заполнителей в html-шаблоне, которые будут заменены на результаты,
        //полученные из базы данных
        $needle = array("[link]", "[href]");
        //объект
        $db_object = $mysqli_object->fetch_object();
        //вырезать из шаблона часть между метками [while] (html элемент списка с ссылкой) и результат поместить в массив $items
        //$items[1] будет содержать вырезанную часть, которая и будет обрабатыватьбя в цикле
        preg_match("/\[while\](.*?)\[while\]/s", $this->template, $items);

        if ($db_object != "") {//если объект не пустой
            //переместить указатель результата в начало
            $mysqli_object->data_seek(0);
            //запускать цикл, пока присутсвует очередная строка результата
            while ($db_object = $mysqli_object->fetch_object()) {
                //присвоить переменной ссылку на файл шаблона, т.к. непосредственное обращение к $this->template в цикле
                //в каждом проходе цикла осуществляет новое чтение файла шаблона, что сказывается на быстродействии
                $temp_template = $items[1];
                //если поле href в базе данных пустое, то внести в переменную $href значение поля category_id из таблицы menu
                if ($db_object->href == "") $href = "?category=" . $db_object->category_id;
                //иначе в переменную $href внести значение поля href из таблицы меню
                else $href = $db_object->href;
                //обновляющийся при каждом проходе цикла массив значений из базы данных, значения которого будут заменять
                //метки-заполнители (массив $needle) полученного файла html-шаблона
                $replace = array($db_object->name, $href);
                //заменить массив меток-заполнителей на массив значений базы данных в файле шаблона
                $temp_template = str_replace($needle, $replace, $temp_template);
                //результаты распарсенного с замененными значениями шаблона на каждом проходе цикла конкатенируются в этой переменной
                $menu .= "$temp_template";
            }
            //вместо [while]...[while] из файла шаблона вклеить сгенерированный код из $menu
            $menu = preg_replace("/\[while\](.*?)\[while\]/s", $menu, $this->template);
        } //если $db_object пуст
        else $menu = "";
        //вернуть строку (можно сказать, что возвращается html-разметка) с замененными значениями
        return $menu;
    }

}